Revit 2026 API

# GradientTextureScaleLock Property

---

The property labeled "Scale Lock" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureScaleLock { get; }
```
```vb
Public Shared ReadOnly Property TextureScaleLock As String
	Get
```
```cpp
public:
static property String^ TextureScaleLock {
	String^ get ();
}
```
```fsharp
static member TextureScaleLock : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace